#+TITLE: Modernes C++\linebreak \small...für Programmierer \hfill Unit 02: Ein- und Ausgabe
#+AUTHOR: Dr. Günter Kolousek
#+OPTIONS: H:1 toc:nil
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [presentation]
#+BEAMER_THEME: Execushares
#+COLUMNS: %45ITEM %10BEAMER_ENV(Env) %10BEAMER_ACT(Act) %4BEAMER_COL(Col) %8BEAMER_OPT(Opt)

#+LATEX_HEADER:\usepackage{pgfpages}
# +LATEX_HEADER:\pgfpagesuselayout{2 on 1}[a4paper,border shrink=5mm]
# +LATEX: \mode<handout>{\setbeamercolor{background canvas}{bg=black!5}}
#+LATEX_HEADER:\usepackage{xspace}
#+LATEX: \newcommand{\cpp}{C++\xspace}
#+LATEX: \newcommand{\cppXIV}{C++14\xspace}
#+LATEX: \newcommand{\cppXI}{C++11\xspace}
#+LATEX: \newcommand{\cppXVII}{C++17\xspace}

* "Hello, World!" -- 4
#+header: :exports both :tangle src/hello4.cpp
#+BEGIN_SRC C++ :results output
// hello4.cpp
#include <iostream>

using namespace std;

int main() {
    cout << "Hello, World!";
}
#+end_src

#+RESULTS:
: Hello, World!

#+beamer: \pause

Am Prozessende werden immer die Buffer geleert (außer u.U. wenn Prozess abstürzt)!

